app/views/comments/_comment.html.erb

INSERT INTO `comments` (`body`, `user_id`, `lection_id`, `created_at`, `updated_at`) VALUES ('My first comment', 1, 13, '2018-12-02 08:57:15', '2018-12-02 08:57:15')
---
    <div class="card-footer text-muted">
        <%= "#{time_ago_in_words(comment.created_at)}" + "#{t('show.ago')}" %>