app/views/users/_info_widget.html.erb

SELECT COUNT(*) FROM `lections` WHERE `lections`.`user_id` = 1
---
        <%#=  @user.current_sign_in_at %>
    <%= t('home.lection') %> <strong> <%= @user.username %></strong> : <%= @user.lections.count %>