app/views/users/edit_multiple.html.erb

SELECT `users`.* FROM `users`
---
          <tbody>
            <% User.all.each do |user| %>