app/views/pages/home.html.erb

    <div class="col-md-8">
      <%= render Lection.where("average_rate > ?", 0).limit(3).order(average_rate: :desc) %>
---
SELECT  `lections`.* FROM `lections` WHERE (average_rate > 0) ORDER BY `lections`.`average_rate` DESC LIMIT 3

      <h2 class="background-text" style="margin: 5px"><%= t('home.most_recent') %></h2>
      <%= render Lection.all.order(created_at: :desc).limit(3) %>
---
SELECT  `lections`.* FROM `lections` ORDER BY `lections`.`created_at` DESC LIMIT 3