app/views/lections/_form.html.erb

            <div class="col-8">
              <%= form.text_field :tag_list, class: "form-control ", id: "tags", data: {autocomplete: ActsAsTaggableOn::Tag.pluck(:name)} %>
---
SELECT `tags`.`name` FROM `tags`