app/controllers/lections_controller.rb

SELECT `lections`.* FROM `lections`
---
  def index
    @lections = Lection.all

SELECT lections.id FROM `lections`
SELECT tags.*, taggings.tags_count AS count FROM `tags` JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM `taggings` INNER JOIN lections ON lections.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Lection' AND taggings.context = 'tags') AND (taggings.taggable_id IN (1,2,3,4,5,6,7,8,9,10,13,12)) GROUP BY taggings.tag_id HAVING (COUNT(taggings.tag_id) > 0)) AS taggings ON taggings.tag_id = tags.id
---
  def tagged
    if params[:tag].presence
      @tag = params[:tag]
      @lections = Lection.tagged_with(@tag)
    else
      @lections = Lection.all

SELECT `comments`.* FROM `comments` WHERE `comments`.`lection_id` = 1 ORDER BY updated_at DESC
---
  def show
    @current_user = current_user
    @rating=Rating.new
    @comment = Comment.new
    @comments = @lection.comments.order( "updated_at DESC")

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 26 LIMIT 1
---
  def new
    if current_user.admin and admin_as_user
      @new_user = User.find(admin_as_user)

SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'Создатьnew' LIMIT 1
INSERT INTO `lections` (`title`, `description`, `speciality`, `body`, `created_at`, `updated_at`, `user_id`) VALUES ('fsdffffffffffffff', 'sdggg', 2, 'sereeteewwwwwwwwwwwwwwwwwwwww', '2018-12-03 19:12:34', '2018-12-03 19:12:34', 26)
---
  def create
    @lection = Lection.new(lection_params)
    if new_user = User.find_by(username: params[:commit].split().last)
      @lection = new_user.lections.new(lection_params)
    else
      @lection = current_user.lections.new(lection_params)
    end
    respond_to do |format|
      if @lection.save

UPDATE `lections` SET `body` = '#My new app\r\njkjkjkjkjk', `updated_at` = '2018-12-02 08:58:46' WHERE `lections`.`id` = 13
---
  def update
    respond_to do |format|
      if @lection.update(lection_params)

DELETE FROM `lections` WHERE `lections`.`id` = 24
---
  def destroy
    @lection.destroy

SELECT  `lections`.* FROM `lections` WHERE `lections`.`id` = 36 LIMIT 1
---
  def set_lection
    @lection = Lection.find(params[:id])