app/controllers/ratings_controller.rb

SELECT  `ratings`.* FROM `ratings` WHERE `ratings`.`lection_id` = 1 AND `ratings`.`user_id` = 1 LIMIT 1
INSERT INTO `ratings` (`rating`, `user_id`, `lection_id`) VALUES (4, 1, 1)
---
  def create
    if @lection.ratings.where(user: current_user)
      @rating = edit
    else
      @rating = create_new
    end
    @rating.user = current_user
    @rating.save

DELETE FROM `ratings` WHERE `ratings`.`id` = 118
SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`lection_id` = 1 AND `ratings`.`user_id` = 1
---
  def edit
     @lection.ratings.where(user: current_user).destroy_all

SELECT  `lections`.* FROM `lections` WHERE `lections`.`id` = 1 LIMIT 1
---
  def set_lection
    @lection = Lection.find(params[:lection_id])