app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @lections= @user.lections.order(params_sort + " " + params_direction)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `lections`.* FROM `lections` WHERE `lections`.`user_id` = 1 ORDER BY speciality desc

  def current_user_theme
    current_user.update(theme: params[:theme])
---
UPDATE `users` SET `theme` = 'light', `updated_at` = '2018-12-02 09:02:42' WHERE `users`.`id` = 1

  def destroy
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def make_user
    @user.each do  |user_to_admin|
      user_to_admin.admin=false
      user_to_admin.save
---
UPDATE `users` SET `admin` = TRUE, `updated_at` = '2018-12-03 14:42:56' WHERE `users`.`id` = 24

  def edit_multiple
    @user=User.where(id: params[:user_ids])
    if params_edit == t('common.destroy')
      @user.destroy_all
    elsif params_edit == t('common.lock')
      @user.each {|user_to_lock| user_to_lock.lock_access! }
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 21
SELECT `users`.* FROM `users`