app/models/lection.rb

  def current_user_rating current_user
    if current_user_rating = self.ratings.find_by(user_id: current_user.id)
---
SELECT  `ratings`.* FROM `ratings` WHERE `ratings`.`lection_id` = 20 AND `ratings`.`user_id` = 24 LIMIT 1

  def average_rating
    if self.ratings.count > 1
      rating_sum = 0
      self.ratings.pluck(:rating).each { |t| rating_sum += t }
      average_rate = rating_sum.to_f / self.ratings.count.to_f
      self.update(:average_rate => average_rate)
---
SELECT COUNT(*) FROM `ratings` WHERE `ratings`.`lection_id` = 20
SELECT `ratings`.`rating` FROM `ratings` WHERE `ratings`.`lection_id` = 1
SELECT COUNT(*) FROM `ratings` WHERE `ratings`.`lection_id` = 1
UPDATE `lections` SET `average_rate` = 4.5, `updated_at` = '2018-12-02 08:51:05' WHERE `lections`.`id` = 1