app/views/layouts/_navbar.html.erb

          <%= form_for :search_lections, url: search_lections_path, method: :get do |f| %>
          <%= f.text_field :query, value: params[:search_lections].presence && params[:search_lections][:query], class: "form-control mr-sm-2", placeholder: t('common.search') %>
---
SELECT lections.id FROM `lections`