app/views/layouts/_widget.html.erb

SELECT COUNT(*) FROM `lections` WHERE `lections`.`user_id` = 1
---
    <div class="h6 text-muted"> <%= t('home.lection')%> </div>
    <div class="h5"><%= current_user.lections.count  %></div>